# Built In Failures Import Failures ATFContained Unsupported Geometric Data Property

Source: https://www.revitapidocs.com/2026/48884c0e-99a0-f504-3c1a-6e6464627385.htm

---

| Built In Failures Import Failures ATFContained Unsupported Geometric Data Property |
| --- |

**Note: This API is now obsolete.**

The original model contains unsupported geometric data.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedGeometricData instead.")]
public static FailureDefinitionId ATFContainedUnsupportedGeometricData { get; }
```

```
<ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedGeometricData instead.")>
Public Shared ReadOnly Property ATFContainedUnsupportedGeometricData As FailureDefinitionId
	Get
```

```
public:
[ObsoleteAttribute(L"This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedGeometricData instead.")]
static property FailureDefinitionId^ ATFContainedUnsupportedGeometricData {
	FailureDefinitionId^ get ();
}
```

```
[<ObsoleteAttribute("This failure is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use ImportContainedUnsupportedGeometricData instead.")>]
static member ATFContainedUnsupportedGeometricData : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ImportFailures Class Autodesk.Revit.DB Namespace